{
  "id": "p2",
  "title": "Elon Musk",
  "dt": "Feb 24, 2024",
  "tags" : [
    "Elon Musk"
  ],
  "body": "<p>\n<img src=\"img/2024-02-24b.jpg\" />\n<div class=\"card-caption\">\n<a href=\"https://www.nytimes.com/events/dealbook-summit-2023/sessions/elon-musk\">Elon Musk to advertisers: \"Go f**k yourself.\" - NYT (Nov 29, 2023)</a>\n</div>\n</p>\n<p>\nElon Musk is obviously an incredibly polarizing figure.\n</p>\n<p>\nWhat strikes me most about Elon is that he represents a certain class of people (a very small, rarified sphere) who have accumulated sufficient resources that the \"normal rules of society\" do not apply to him. (Donald Trump is another person in this category.) Antics that would get any other person on earth fired/ridiculed/exiled somehow don't affect Elon and Donald the same way. More than anything else, the enduring \"teflon nature\" of their mere existence endlessly fascinates me.\n</p> \n<p> Additionally, Elon's approach towards parenting resonates with me too. He is the father of eleven children with three different women. Once a reporter asked him how he handled being a dad while running so many other transformational companies. Didn't his kids miss him? Has he needed to sacrifice seeing soccer games and attending recitals in order to simultaneously oversee rocket missions into outerspace? Elon's answer has always stuck with me: <strong>&quot;I don't think my kids will care I missed so much of their childhoods. Rather, I'll be the dad who brought electric cars to America. I'll be the dad who helped humanity colonize Mars. That's how they'll remember me. They'll be proud.&quot;</strong>  \n</p>\n<p>\n Sadly, becoming a parent <a href='javascript:goto(\"p0n\");'>isn't currently in the cards for me</a> but if I were a multi-billionaire like Elon, I'd definitely have a ton of kids! (Though, just with one SO, not with three.) \n</p><p>\nFinally, one other thing I can say about Elon is that he really does test my general value of <strong>\"divorcing a work from its author\"</strong>. I can't speak to Twitter because I never really used it. But I've been heavily using X since December 2023 and <a href='javascript:goto(\"p3n\");'>I positively love that platform</a>. Amazing <a href=\"https://twitter.com/robert_gpt/status/1757745849868628335\">Xeople</a> and scintillating conversations every single time I open the app! No where else on today's internet have I found a platform that promotes continuous learning and curiosity exploration than X does. I'm a huge fan!\n</p>",
  "img": {
    "src": "img/2024-02-24.jpg",
    "title": "&quot;&quot;"
  }
}
