{
  "id": "p3",
  "title": "My Love Letter to 𝕏",
  "dt": "Jan 1/Mar 17, 2024",
  "tags" : [
    "a desire to connect",
    "find your tribe",
    "jeff bezos",
    "2024 resolution",
    "x"
  ],
  "body": "<p>          <div class=\"quote\">            \"For 2024, I am resolving to pour myself onto X every single day to connect with random internet strangers who share my values. Together, we can make X what the internet was always supposed to be.\"          </div>        </p>        <div class=\"card-subheader\">X's Identity</div>        <p>          All social media platforms have identities. Instagram is for beautiful aesthetics; people who love photos and art (and who are likewise beautiful themselves). Tik Tok is for short videos/an organ of the CCP. So forth.        </p>        <p>            So, what is X known for? Now I know. X is the platform for <strong><em>thoughts</em></strong>.        </p>        <p>            What I love about X, now that I've used it heavily for three weeks, is that it's largely filled a void I've unsuccessfully tried to fill my entire life. A thirst for knowledge; a desire to connect with other interesting, likeminded, and curious people; a platform for continuous learning.        </p>        <p>            And what enables this are the underlying machine learning models for how X connects people, as well as its form factor.        </p>        <div class=\"card-subheader\">Twitter's Recommendation Algorithm</div>        <p>          Every day, 500 million tweets are posted on Twitter. And incredibly, <a href=\"https://blog.twitter.com/engineering/en_us/topics/open-source/2023/twitter-recommendation-algorithm\">Twitter's Recommendation Algorithm</a> can <a href=\"https://www.ueo-workshop.com/wp-content/uploads/2014/04/sig-alternate.pdf\">distill that half-billion</a> into the <a href=\"https://www.vldb.org/pvldb/vol9/p1281-sharma.pdf\">hyper-personalized handful</a> on each <a href=\"https://dl.acm.org/doi/10.1145/3394486.3403370\">individual user's <strong>For Your</strong> timeline</a>.        </p>        <div class=\"tweet\">          <blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p lang=\"en\" dir=\"ltr\">Good to know how <a href=\"https://twitter.com/X?ref_src=twsrc%5Etfw\">@X</a> works:<br><br>&quot;This requires a rec algo to distill the roughly 500 million Tweets posted daily down to a handful of top Tweets that ultimately show up on your device’s For You timeline.&quot;<br><br>- <a href=\"https://t.co/u96usb4FPa\">https://t.co/u96usb4FPa</a><br>- <a href=\"https://t.co/f3h7KAky7t\">https://t.co/f3h7KAky7t</a><br>- <a href=\"https://t.co/ls4X7fNXRJ\">https://t.co/ls4X7fNXRJ</a> <a href=\"https://t.co/L5HwspmGpy\">pic.twitter.com/L5HwspmGpy</a></p>&mdash; Robert Lin (@robert_gpt) <a href=\"https://twitter.com/robert_gpt/status/1741234254455947581?ref_src=twsrc%5Etfw\">December 30, 2023</a></blockquote>        </div>                  <p>          In a different post, I'll do a deep dive into the technical details. But for now, suffice it to say– after three weeks of heavy use, I'm concluding (empirically, at least) is that for me: it works.              </p>        <p>          Sure– one day, <a href=\"https://blueskyweb.xyz/blog\">Blue Sky</a> and its concept of <a href=\"https://atproto.com/\">\"Algorithmic Choice\"</a> may be the future. But for now, I'll trust Elon. Proof is in the pudding! Again, YMMV. But for me, my X feed has been the most insight-dense and fascinating source of high-quality knowledge/amusement/advice/<a href=\"https://www.theverge.com/23940924/elon-musk-x-twitter-all-hands-linda-yaccarino-super-app\">everything</a> that I've ever seen concentrated in a single place.        </p>        <p>          And the beauty: X is designed for <strong><em>active engagement</em></strong>. The more I tweet, reply, bookmark, and like other tweets, the <strong><em>better</em></strong> X gets at personalizing my <strong>For You</strong> feed! Is this not the dream of machine learning? To use all of that fancy linear algebra to tailor each human's individual internet experience to be as singularly special as they are?          </p>        <div class=\"card-subheader\">Form Factor: 𝕏 Moves at the Speed of Thought</div>        <p>          Additionally, expanding on <strong>\"creation\"</strong> for a bit: it's no secret that most internet users are passive unengaged lurkers and seldom contribute. Personally, I'm plenty guilty, having only overwhelmingly used <strong>Reddit</strong> pasively for many years. All these years, I've essentially only just been a <strong>taker</strong> and have never <strong>given</strong> back.        </p>        <p>          What I love about X though is that everything from its UX to its existing content to its culture promotes <strong><em>creation and engagement</em></strong>. It promotes <strong><em>genuine connection</em></strong>. As someone who is verbose and struggles with succinctness, I love that each tweet is capped at <a href=\"https://blog.twitter.com/official/en_us/topics/product/2017/tweetingmadeeasier.html\">280 characters</a>. <strong>\"Brevity is the soul of wit\"</strong>, as the common Shakespeare adage goes.        </p>        <p>          And since tweets are so easy to disseminate, this microblogging platform is now categorically different than anything I'd ever used before. I've always loved writing from ever since childhood. Spiralbound notebooks, then <strong>WordPress</strong>, and <strong>Ghost</strong>. Additionally, I have personal <strong>OneNote</strong> and <strong>Notion</strong> notebooks filled to the brim with my own scribbles.        </p>        <p>          But the big challenge with blogging is friction. It just takes too much time and energy to sit down and compose long entries (like this). There's obviously a time and place for it, to write out longer, more thoroughly developed pieces. But something was missing for me. I love sharing videos, articles, and books with my family, friends, and coworkers (what <a href=\"https://tomcritchlow.com\">Tim Critchlow</a> calls, <a href=\"https://tomcritchlow.com/2023/01/20/digital-bricolage\">\"digital bricolage\"</a>). And I've probably shared thousands of such links over the years.        </p>        <p>          But all of those shares are now sadly lost to the wind, scattered across half-a-dozen different platforms. Buried in emails, Slack, FB Messenger, Google Hangouts, etc.        </p>        <p>          X fixes this.        </p>        <div class=\"card-subheader\">\"Spirit of the Times\" vs \"Spirit of the Depths\"</div>        <p>          Carl Jung has a framework called <a href=\"https://twitter.com/robert_gpt/status/1747789550808637643\">\"The Two Spirits\"</a>. Any given day, there are essentially <strong>\"two spirits that animate us\"</strong>. He breaks it down:        </p>          <ul>            <li><strong>The Spirit of the Times</strong> - Anything worldly. What Powell at the Fed is doing. War in Ukraine and Israel, etc.</li>            <li><strong>The Spirit of Depths</strong> - The existential questions of being human. Who are we? Why are we here? Are we playing the right game? Deep philosophical questions which have no single answers but are profoundly important for each man, woman, and child on earth to individually wrestle and grapple with.</li>          </ul>        <p>          With X, I now <strong><em>finally</em></strong> have a tool where I can wrap certain links before I share them with others. Obviously, everyone uses X differently. The way I use X is just about entirely exclusive to <strong>\"The Spirit of the Depths\"</strong>. (For my worldly news, I subscribe to other sources (WSJ, The Atlantic, etc).) But for the good stuff– how to be a human in the world, how to coexist with others– for all that stuff, I now first aggregate and encapsulate in X, and then I share a link to my tweet.        </p>        <p>          In short:        </p>        <div class=\"tweet\">          <blockquote class=\"twitter-tweet\" data-media-max-width=\"560\"><p lang=\"en\" dir=\"ltr\">I ❤ X bc it provides a public space for me to dump my &quot;most important&quot; thoughts (sometimes even with commentary). Since each tweet (thought) has a permanent URL, I can then link to it (from emails, Slack, Notion, etc). My X profile will eventually be a highlight reel of my mind.</p>&mdash; Robert Lin (@robert_gpt) <a href=\"https://twitter.com/robert_gpt/status/1738417049620095166?ref_src=twsrc%5Etfw\">December 23, 2023</a></blockquote>        </div>        <div class=\"card-subheader\">Authenticity by Volume: \"Quantity is a Quality All Its Own\"</div>        <p>          To be clear, X is not the entirety of my being. However, I do believe that the facet of myself which I present on X is genuinely an authentic part of me, simply by virtue of sheer volume. If you want to get to know me, just look at my <a href=\"https://twitter.com/robert_gpt\">tweets</a>, <a href=\"https://twitter.com/robert_gpt/with_replies\">replies</a>, and <a href=\"https://twitter.com/robert_gpt/likes\">likes</a>. As Sagan once remarked, <strong>\"Quantity is a Quality All Its Own.\"</strong>        </p>        <p>          X is all about fly-by-night thoughts. All of the interactions you have with others <strong><em>reveal</em></strong> who you already are. No facade can – in the long haul– withstand such volume. A fundamental nature of your character, at this scale of engagement –all hours of the day; all days of the year– will simply reveal itself.        </p>        <div class=\"card-subheader\">Stream-of-Consciousness Dissemination Tool to Find High-Affinity Nodes</div>        <p>          In this regard X is a stream-of-consciousness dissemination tool to find other high-affinity nodes.        </p>        <p>          So for 2024, I am resolving to connect both more broadly and more deeply with other humans, using X as my chariot. For all my life, I've struggled to answer the question of <strong><em>where do I focus my finite time, energy, and attention?</em></strong> Some focus on their children. Others on startups or their local community. After thinking about this long and hard, I've decided to focus on pouring myself onto X to <strong><em>connect</em></strong> with random internet strangers who (according to X) share my values. X operates at planetary scale and is neither biologically constrained nor limited by national borders. Sure, when you tweet, only a handful of people may ever see what you write. <strong>But you never know the n-th order effects.</strong> Just by making an impression on one person at the right time in the right place could make all the difference.        </p>        <div class=\"card-subheader\">𝕏: What the Internet was Meant to Be</div>        <p>          Connection with other humans is quintessential to <strong><em>being human</em></strong>. This was always <strong>the dream of what the internet would be</strong>: a way for people from the world over to <strong><em>connect</em></strong> with each other. To actually communicate, share thoughts <strong><em>bidirectionally</em></strong>, with great velocity, without friction. <strong>To become more than the sum of our parts.</strong>        </p>        <p>          At the day's end, my hope for humanity is Jeff Bezos's hope for humanity: to become <strong><em>a trillion humans-strong across the solar system</em></strong>. But we can only get there if we all play our parts. By <a href=\"https://arnoldspumpclub.com\">lifting each other up</a>; <strong>affirming and encouraging</strong>; but also <strong>challenging</strong> and holding one another accountable.        </p>        <p>          So this year, in 2024, I'm resolving to do my part: to reach out to random internet strangers across all of X <strong>every single day</strong> to connect.        </p>        <p>          <strong><a href=\"https://www.youtube.com/watch?v=NjZUYtkyE00\">Let's get started.</a></strong> 🌎🚀✨        </p>        <div class=\"tweet\">          <blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">🌠<a href=\"https://twitter.com/JeffBezos?ref_src=twsrc%5Etfw\">@JeffBezos</a>&#39;s hopes for humanity:<br><br>&quot;I&#39;d ❤ to see a trillion humans living in the solar system. If we had a trillion humans, we&#39;d have a thousand Mozarts, a thousand Einsteins. Our solar system would be full of life &amp; intelligence &amp; energy.&quot; <br><br>Jeff&#39;s dream is now my dream🌎🚀✨ <a href=\"https://t.co/Cp3yUuZV11\">pic.twitter.com/Cp3yUuZV11</a></p>&mdash; Robert Lin (@robert_gpt) <a href=\"https://twitter.com/robert_gpt/status/1741868537537343595?ref_src=twsrc%5Etfw\">January 1, 2024</a></blockquote>        </div>",
  "img": {
    "src": "x-love-letter.png",
    "title": "DALL-E3: &quot;Draw me a banner image for an article titled, 'My Love Letter to X'.&quot;"
  }
}